blog/pass.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>pass</title>
<!-- 2021-08-06 Fri 00:44 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Siqing Mu" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">pass</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 基础操作</a>
<ul>
<li><a href="#sec-1-1">1.1. 初始化</a></li>
<li><a href="#sec-1-2">1.2. 创建密码</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. 生成密码，你也可以通过insert密码</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. 查看密码</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. 列出所有密码项</a></li>
<li><a href="#sec-1-3-2">1.3.2. 显示某个密码项中的密码</a></li>
<li><a href="#sec-1-3-3">1.3.3. 直接复制到粘贴板</a></li>
<li><a href="#sec-1-3-4">1.3.4. 通过二维码显示</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. 修改密码</a></li>
<li><a href="#sec-1-5">1.5. 删除密码</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 其他</a></li>
</ul>
</div>
</div>
<p>
Pass 是一个标准的 unix 密码管理器。
</p>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 基础操作</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 初始化</h3>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 创建密码</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> 生成密码，你也可以通过insert密码</h4>
<div class="outline-text-4" id="text-1-2-1">
<pre class="example">
pass generate Email/jasondonenfeld.com 15
The generated password to Email/jasondonenfeld.com is:
$(-QF&amp;Q=IN2nFBx
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 查看密码</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> 列出所有密码项</h4>
<div class="outline-text-4" id="text-1-3-1">
<pre class="example">
pass
</pre>
<p>
或者
</p>
<pre class="example">
pass ls
</pre>
<p>
或者
</p>
<pre class="example">
pass show
</pre>
</div>
</div>
<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> 显示某个密码项中的密码</h4>
<div class="outline-text-4" id="text-1-3-2">
<pre class="example">
zx2c4@laptop ~ $ pass Email/zx2c4.com
sup3rh4x3rizmynam3
</pre>
</div>
</div>
<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> 直接复制到粘贴板</h4>
<div class="outline-text-4" id="text-1-3-3">
<pre class="example">
zx2c4@laptop ~ $ pass -c Email/zx2c4.com
Copied Email/jason@zx2c4.com to clipboard. Will clear in 45 seconds.
</pre>
</div>
</div>
<div id="outline-container-sec-1-3-4" class="outline-4">
<h4 id="sec-1-3-4"><span class="section-number-4">1.3.4</span> 通过二维码显示</h4>
<div class="outline-text-4" id="text-1-3-4">
<pre class="example">
zx2c4@laptop ~ $ pass -q Email/zx2c4.com
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 修改密码</h3>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 删除密码</h3>
<div class="outline-text-3" id="text-1-5">
<pre class="example">
zx2c4@laptop ~ $ pass rm Business/cheese-whiz-factory
rm: remove regular file ‘/home/zx2c4/.password-store/Business/cheese-whiz-factory.gpg’? y
removed ‘/home/zx2c4/.password-store/Business/cheese-whiz-factory.gpg’
</pre>
</div>
</div>
</div>





<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 其他</h2>
<div class="outline-text-2" id="text-2">
<p>
在使用 iterm 终端删除密码或覆盖密码时二次确认，会让输入y回车确认。如果回车失败，显示^M 的符号，可以使用下面命令恢复。
</p>
<pre class="example">
stty sane
</pre>

<ul class="org-ul">
<li><a href="https://www.passwordstore.org/">https://www.passwordstore.org/</a>
</li>
<li><a href="https://wiki.archlinux.org/title/Pass">https://wiki.archlinux.org/title/Pass</a>
</li>
<li><a href="https://blog.sanctum.geek.nz/gnu-linux-crypto-passwords/">https://blog.sanctum.geek.nz/gnu-linux-crypto-passwords/</a>
</li>
<li><a href="https://keyring.debian.org/creating-key.html">https://keyring.debian.org/creating-key.html</a>
</li>
<li><a href="https://wiki.debian.org/Subkeys?action=show&redirect=subkeys">https://wiki.debian.org/Subkeys?action=show&redirect=subkeys</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>